import { dessert, hotShiro, kurkum, shiro } from "./imageFiles";

export const topCategories = [
  {
    _id: "123",
    name: "קמחים",
    images: [hotShiro],
  },
  {
    _id: "124",
    name: "תבלינים",
    images: [kurkum],
  },
  {
    _id: "125",
    name: "קטניות",
    images: [shiro],
  },
  {
    _id: "126",
    name: "משקאות",
    images: [dessert],
  },
  {
    _id: "126",
    name: "מארזים",
    images: [dessert],
  },
];

export const packages = [
  {
    _id: "1",
    name: "מתכון קצר",
    image: shiro,
    price: 10,
    cookingTime: 5,
    ingredientsQuantity: 20,
    peoplesQuantity: 50,
  },
  {
    _id: "2",
    name: "מתכון סופי",
    image: dessert,
    price: 20,
    cookingTime: 10,
    ingredientsQuantity: 30,
    peoplesQuantity: 75,
  },
  {
    _id: "3",
    name: "מתכון ממוקד",
    image: hotShiro,
    price: 30,
    cookingTime: 15,
    ingredientsQuantity: 40,
    peoplesQuantity: 100,
  },
];

export const qaItems = [
  {
    q: "מה מיוחד במוצרים שלכם?",
    a: "המוצרים שלנו משלבים בין איכות גבוהה וטעמים ייחודיים המגיעים מתרבויות מגוונות, תוך הקפדה על רכיבים טבעיים ואותנטיים.",
  },
  {
    q: "האם כל המוצרים טבעיים?",
    a: "כן, כל המוצרים שלנו מיוצרים מרכיבים טבעיים בלבד, ללא חומרים משמרים או תוספים מלאכותיים, כך שתוכלו ליהנות מאיכות בריאה ואמיתית.",
  },
  {
    q: "האם אתם מבצעים משלוחים?",
    a: "בהחלט! אנו מבצעים משלוחים לכל רחבי הארץ כדי שתוכלו ליהנות מהמוצרים שלנו עד לפתח הבית.",
  },
  {
    q: "האם ניתן למצוא מוצרים ללא גלוטן?",
    a: "כן, בחנות שלנו תוכלו למצוא מוצרים רבים המתאימים לתזונה ללא גלוטן, כמו קמח טף ומוצרים נוספים שמותאמים לרגישים לגלוטן.",
  },
  {
    q: "האם אתם מציעים מתכונים לשימוש במוצרים?",
    a: "כן, באתר שלנו תוכלו למצוא מתכונים מגוונים שמדגימים כיצד להשתמש במוצרים כדי ליצור מנות טעימות ואותנטיות במטבח שלכם.",
  },
  {
    q: "איך אני יכול לדעת אילו מוצרים מומלצים?",
    a: "בחנות שלנו מופיע דירוג מוצרים, כך שתוכלו לראות את המוצרים המומלצים והפופולריים ביותר לפי חוות דעת של לקוחות אחרים.",
  },
  {
    q: "האם המוצרים מתאימים לאנשים עם אורח חיים בריא?",
    a: "בהחלט! כל המוצרים שלנו נבחרו בקפידה כדי לספק ערכים תזונתיים גבוהים ולתמוך באורח חיים בריא ומאוזן.",
  },
];
